============================================
Invalid statements
============================================

what the heck is this
y();

if (x) {
  >>>
  var y = right
}

---

(program
  (expression_statement (ERROR 't'))
  (expression_statement (function_call (identifier)))
  (if_statement (identifier) (statement_block
    (expression_statement (ERROR '>'))
    (var_declaration (var_assignment (identifier) (identifier))))))

============================================
Invalid if conditions
============================================

if (%$&^)
  wat();

okWhatever();

---

(program
  (if_statement (ERROR '%')
    (expression_statement (function_call (identifier))))
  (expression_statement (function_call (identifier))))

============================================
Invalid for loops
============================================

for (i = 0; a b c d e; i++)
  wat();

ok1;

for (a b c d; e; i++)
  wat();

ok2;

for (a; b; c d e f)
  wat();

---

(program
  (for_statement
    (assignment (identifier) (number))
    (ERROR 'b')
    (math_op (identifier))
    (expression_statement (function_call (identifier))))

  (expression_statement (identifier))

  (for_statement
    (ERROR 'b')
    (identifier)
    (math_op (identifier))
    (expression_statement (function_call (identifier))))

  (expression_statement (identifier))

  (for_statement
    (identifier)
    (identifier)
    (ERROR 'd')
    (expression_statement (function_call (identifier)))))

============================================
Invalid statement blocks
============================================

function() { ^ & * }

---

(program
  (expression_statement (function (statement_block (ERROR '^')))))

============================================
Invalid objects
============================================

x = {
  key1: value1,

  abc efg,

  key2: value2
};
---

(program (expression_statement (assignment
  (identifier)
  (object
    (pair (identifier) (identifier))
    (ERROR 'e')
    (pair (identifier) (expression (identifier)))))))

============================================
Invalid items in var declarations
============================================

var
  a = 1,
  -b,
  c = 2,
  d = = = = =,
  e;
---

(program (var_declaration
  (var_assignment (identifier) (number))
  (ERROR '-')
  (var_assignment (identifier) (number))
  (ERROR '=')
  (identifier)))
